import './App.css';

function App() {
  // 1. 할 일 목록 생성 - 사용자가 새로운 할 일을 입력할 수 있는 기능.
  // 2. 할 일 목록 표시 - 입력된 할 일을 목록 형태로 보여주는 기능.
  // 3. 할 일 완료 표시 - 할 일의 완료 상태를 표시 및 변경할 수 있는 기능.
  // 4. 할 일 개수 표시 - 전체 및 남아 있는 할 일의 개수를 표시하는 기능.

  // 5. 할 일 삭제 - 목록에서 특정 할 일을 삭제하는 기능.
  // 6. 할 일 수정 - 이미 입력된 할 일의 내용을 수정하는 기능.
  // 7. 할 일 필터링 - 완료된 할 일과 진행 중인 할 일을 구분하여 볼 수 있는 필터 기능.

  // 8. 할 일 일괄 완료 처리 - 모든 할 일을 한 번에 완료 처리할 수 있는 기능.
  // 9. 할 일 일괄 삭제 - 완료된 할 일만을 선택적으로 일괄 삭제하는 기능.
  // 10. 지속성 - 데이터를 지속적으로 저장하여 ,웹 페이지 새로고침 후에도 할 일 목록을 유지.

  return (
    <>
      <input />
    </>
  );
}

export default App;
